{
  "name": "Terran Consensus",
  "faction": "terran",
  "description": "The Terran Consensus represents humanity's unified expansion into the stars. Their approach combines advanced technology, scientific research, and military precision. The Terran strategy typically focuses on shield technology, research advancement, and tactical flexibility.",
  "flavor": "The stars await those with the vision to see beyond present limitations. —Admiral Helena Kerner, Terran Consensus Expansion Fleet",
  "cards": [
    {
      "id": 1,
      "name": "Hyperion",
      "type": "capital_ship",
      "cost": 4,
      "stats": { "attack": 3, "defense": 2, "speed": 1 },
      "ability": "Can perform Orbital Strike (Attack -1) against surface targets once per turn",
      "flavor": "The Hyperion's guns speak for humanity. —Admiral Kerner",
      "art": {
        "style": "Retro-futuristic technical illustration like John Berkey",
        "description": "A massive battlecruiser with elongated hull and multiple artillery turrets. The ship features distinctive blue engine glows against the backdrop of a gas giant. The design combines sleek curves with industrial elements, showing battle scars and active weapon systems. Dramatic side lighting highlights the detailed plating and structural elements."
      }
    },
    {
      "id": 2,
      "name": "Nova-class Battlecruiser",
      "type": "capital_ship",
      "cost": 5,
      "stats": { "attack": 5, "defense": 3, "speed": 1 },
      "ability": "Can be equipped with up to 2 weapon systems",
      "special": "When equipped with Quantum Warheads, gains +2 Attack against structures",
      "flavor": "When diplomacy fails, the Nova speaks with absolute clarity. —Captain Torres, TCS Harbinger",
      "art": {
        "style": "Cinematic sci-fi concept art like Dylan Cole",
        "description": "An imposing warship with a hammerhead design and visible weapons arrays. The ship is captured mid-firing its main cannon, with blue-white energy cascading from multiple points. The background shows a distant planet partially eclipsed by its moon. The ship's hull has distinctive geometric patterns with Terran insignia visible on its flanks."
      }
    },
    {
      "id": 3,
      "name": "Liberator Carrier",
      "type": "capital_ship",
      "cost": 5,
      "stats": { "attack": 2, "defense": 4, "speed": 1 },
      "ability": "Can deploy 2 Scout Ships per turn without gate requirement",
      "flavor": "A carrier doesn't just project force—it projects presence across an entire sector. —Admiral Chen",
      "art": {
        "style": "Clean technical render like Syd Mead",
        "description": "A wide, flat carrier vessel with multiple launch bays visible along its sides. Small fighter craft can be seen launching from its ventral hangars. The design emphasizes function over form with a utilitarian aesthetic featuring exposed docking mechanisms and communication arrays. The ship's profile has a distinctive asymmetrical silhouette against a starfield."
      }
    },
    {
      "id": 4,
      "name": "Dreadnought Executor",
      "type": "capital_ship",
      "cost": 6,
      "stats": { "attack": 6, "defense": 4, "speed": 1 },
      "ability": "Once per game, can fire main cannon to deal 8 damage to any single target",
      "flavor": "There are problems diplomacy can solve, and problems the Executor can solve. Rarely do they overlap. —Fleet Commander Zhao",
      "art": {
        "style": "Epic space opera concept art like Ralph McQuarrie",
        "description": "A colossal dagger-shaped capital ship with a massive forward cannon. The ship dwarfs nearby vessels and is captured powering up its main weapon, with energy coursing along conduits on its hull. The vessel features angular geometry with reinforced plating and atmospheric entry capabilities evident in its design. Dramatic lighting emphasizes its intimidating scale."
      }
    },
    {
      "id": 5,
      "name": "Artemis",
      "type": "scout_ship",
      "cost": 2,
      "stats": { "attack": 1, "defense": 1, "speed": 2, "scan": 1 },
      "ability": "+1 to all Scan attempts",
      "flavor": "Knowledge is the first weapon in any engagement. —Lieutenant Vasquez, Recon Division",
      "art": {
        "style": "Sleek digital concept art like Sparth (Nicolas Bouvier)",
        "description": "A nimble reconnaissance vessel with swept-back wings and advanced sensor arrays. The ship has a distinctive glass cockpit bubble and stealth elements in its design. The hull features adaptive camouflage patterns partially engaging. The background shows a nebula with the ship appearing to navigate through a field of stellar debris."
      }
    },
    {
      "id": 6,
      "name": "Apollo",
      "type": "science_ship",
      "cost": 3,
      "stats": { "attack": 0, "defense": 2, "speed": 2, "science": 2 },
      "ability": "Generates 1 Science point per turn when in orbit",
      "flavor": "Every question answered reveals ten more worth asking. That's why we're out here. —Dr. Okonkwo, Chief Science Officer",
      "art": {
        "style": "Clean technical blueprint style like Ron Cobb",
        "description": "A specialized science vessel with extensive external sensor equipment and minimal weapons. The ship has a modular design with detachable research pods and extensive communication equipment. The hull is predominantly white with blue accents and scientific markings. Multiple satellite dishes and scanner arrays dot its exterior, with crew visible through panoramic observation windows."
      }
    },
    {
      "id": 7,
      "name": "Valkyrie Dropship",
      "type": "support_ship",
      "cost": 2,
      "stats": { "attack": 0, "defense": 2, "speed": 2 },
      "ability": "Can transport up to 2 Surface Units from orbit to planetside or vice versa",
      "flavor": "We deliver boots to ground, no matter the weather, no matter the opposition. —Major Rodriguez, Drop Corps",
      "art": {
        "style": "Gritty military sci-fi like Chris Foss",
        "description": "A sturdy, armored transport craft designed for atmospheric entry. The ship has visible thrust vectoring engines, troop deployment ramps, and reinforced hull plating. The design emphasizes functionality with visible landing gear, attachment points, and defensive weaponry. The craft is shown descending through clouds toward a rocky, mountainous terrain."
      }
    },
    {
      "id": 8,
      "name": "Hermes Courier",
      "type": "scout_ship",
      "cost": 1,
      "stats": { "attack": 0, "defense": 1, "speed": 3 },
      "ability": "Draw 1 additional card when this ship is in orbit",
      "flavor": "Information travels at the speed of light. My ship travels faster. —Courier Pilot Nash",
      "art": {
        "style": "Minimalist sci-fi like Moebius (Jean Giraud)",
        "description": "A sleek, compact messenger ship with emphasis on speed. The design features aerodynamic lines, oversized engines, and minimal armaments. The ship has a distinctive single-pilot cockpit with enhanced visibility and data relay equipment. The color scheme uses clean whites with accent colors marking its purpose as a communications vessel."
      }
    },
    {
      "id": 9,
      "name": "Guardian-class Defense Platform",
      "type": "space_station",
      "cost": 3,
      "stats": { "defense": 3 },
      "ability": "Protects adjacent ships from first attack each turn",
      "flavor": "An unyielding sentinel stands watch where human vigilance alone would fail. —Station Commander Park",
      "art": {
        "style": "Detailed isometric technical illustration like Stephen Biesty",
        "description": "An orbital defense station with multiple weapon emplacements and shield generators. The station has a central command module surrounded by defensive arrays in a star pattern. The design includes visible internal compartments showing crew operations and power distribution systems. The station is positioned in low orbit over a partially visible planet surface."
      }
    },
    {
      "id": 10,
      "name": "Orbital Command",
      "type": "space_station",
      "cost": 4,
      "stats": { "defense": 2 },
      "ability": "Grants +1 to all Terran attempt rolls",
      "flavor": "From up here, we see the whole battlefield. Coordination wins wars. —Admiral Kerner, Orbital Command",
      "art": {
        "style": "Cinematic hyperrealism like Peter Elson",
        "description": "A large hexagonal command center with extensive communication arrays and docking facilities. The station features a central glass-domed command bridge with spectacular views of the planet below. The exterior shows multiple landing bays, habitat rings, and defensive systems. The human element is emphasized with visible crew working throughout the structure."
      }
    },
    {
      "id": 11,
      "name": "Research Station Alpha",
      "type": "space_station",
      "cost": 4,
      "stats": { "defense": 2, "science": 2 },
      "ability": "Generates 2 Science points per turn",
      "flavor": "The universe doesn't give up its secrets easily, but we're patient. —Dr. Singh, Research Director",
      "art": {
        "style": "Clean retrofuturism like Robert McCall",
        "description": "A scientific outpost with multiple observatory domes and experimental apparatus. The station has a wheel design for artificial gravity with spoke-like connectors to a central zero-G laboratory. The exterior features solar arrays, telescopes, and specialized research equipment. The background shows stars and cosmic phenomena being studied by the station's instruments."
      }
    },
    {
      "id": 12,
      "name": "Orbital Shipyard",
      "type": "space_station",
      "cost": 5,
      "stats": { "defense": 3 },
      "ability": "Reduce cost of ship deployment by 1 Energy (minimum 1)",
      "flavor": "Every hull that leaves these docks carries humanity's future among the stars. —Master Builder Tanaka",
      "art": {
        "style": "Industrial concept art like Ralph McQuarrie",
        "description": "A massive construction facility with ships in various stages of assembly. The shipyard features enormous robotic arms, manufacturing modules, and raw material processing units. A partially completed capital ship is visible in the main construction bay. The facility bustles with activity as worker drones and maintenance craft swarm around the structure."
      }
    },
    {
      "id": 13,
      "name": "Survey Team Alpha",
      "type": "surface_unit",
      "cost": 2,
      "stats": { "attack": 1, "defense": 1, "scan": 2 },
      "ability": "Can locate hidden resources and artifacts",
      "flavor": "Every step on alien soil writes a new chapter of human history. —Dr. Chen, Xenobiology Division",
      "art": {
        "style": "Painted illustration like Frank Frazetta",
        "description": "A group of armored explorers examining alien ruins on a windswept plain. The team carries advanced scanning equipment and defensive weapons as they investigate a partially buried alien structure. Their environment suits feature Terran insignia and specialized scientific tools. The lighting captures the harsh alien sun casting long shadows as the team documents their findings."
      }
    },
    {
      "id": 14,
      "name": "Vanguard Elite",
      "type": "surface_unit",
      "cost": 4,
      "stats": { "attack": 4, "defense": 3 },
      "ability": "Can attack twice per turn but cannot counter-attack",
      "flavor": "Strike first. Strike hard. Let the enemy know humanity's wrath. —Sergeant Major Kane, Vanguard Division",
      "art": {
        "style": "Military sci-fi concept art like Wayne Barlowe",
        "description": "Heavily armored shock troops with advanced weaponry storming a defensive position. The soldiers wear powered exoskeletons with integrated weapon systems and tactical displays. Their armor features adaptive camouflage partially engaged and distinctive insignia denoting elite status. The composition shows them in dynamic combat poses amid alien terrain."
      }
    },
    {
      "id": 15,
      "name": "Combat Engineers",
      "type": "surface_unit",
      "cost": 3,
      "stats": { "attack": 2, "defense": 2 },
      "ability": "Can repair one damaged structure per turn",
      "flavor": "We build under fire and repair under siege. It's what we do. —Chief Engineer Morrison",
      "art": {
        "style": "Detailed technical concept art like Craig Mullins",
        "description": "Specialized troops with equipment designed for battlefield construction and repair. The engineers operate advanced fabrication tools and portable shield generators. Their armor is more utilitarian than combat troops with multiple tool attachments and diagnostic equipment. The scene shows them repairing damaged defensive structures while under partial cover."
      }
    },
    {
      "id": 16,
      "name": "Science Corps",
      "type": "surface_unit",
      "cost": 2,
      "stats": { "attack": 0, "defense": 1, "science": 2 },
      "ability": "Doubles Science generation of adjacent Research structures",
      "flavor": "In the field, theory becomes reality. That's where the real breakthroughs happen. —Professor Yamada",
      "art": {
        "style": "Bright sci-fi illustration like Angus McKie",
        "description": "Civilian specialists in lightweight environmental suits collecting samples from alien flora. The scientists use holographic interfaces and automated sample collection drones. Their equipment emphasizes data collection rather than combat capabilities with extensive sensor packages. The background shows a vibrant alien ecosystem with unusual plant formations and atmospheric conditions."
      }
    },
    {
      "id": 17,
      "name": "Mobile Research Lab",
      "type": "structure_planetside",
      "cost": 3,
      "stats": { "defense": 2, "science": 1 },
      "ability": "Generates 1 Science point per turn, can be upgraded with Science equipment",
      "flavor": "Science doesn't wait for safety. We bring the lab to the discovery. —Dr. Martinez, Field Research",
      "art": {
        "style": "Cutaway technical illustration like Hans Jenssen",
        "description": "A modular wheeled laboratory with deployable research equipment. The structure features a transparent dome section housing scientific equipment and specimen analysis stations. The design shows both exterior details and a cutaway revealing the interior layout and scientists at work. The lab is positioned in an alien landscape with equipment deployed around its perimeter."
      }
    },
    {
      "id": 18,
      "name": "Advanced Research Complex",
      "type": "structure_planetside",
      "cost": 5,
      "stats": { "defense": 3, "science": 3 },
      "ability": "Generates 3 Science points per turn, advances science-based win conditions",
      "flavor": "Here we unlock the secrets that will shape humanity's next thousand years. —Director Volkov, Advanced Research",
      "art": {
        "style": "Architectural concept art like Syd Mead",
        "description": "A sprawling scientific installation with multiple specialized research domes. The complex combines function and form with elegant structural elements supporting various research apparatus. The facility includes habitat sections, power generation, and defense systems integrated into a cohesive design. Atmospheric effects show how the structure interacts with the alien environment."
      }
    },
    {
      "id": 19,
      "name": "Planetary Shield Generator",
      "type": "structure_planetside",
      "cost": 5,
      "stats": { "defense": 4 },
      "ability": "Can activate up to 3 shield segments, each requiring 1 turn and 2 Energy",
      "winCondition": "When all 3 segments are active with no enemy units on the surface, achieve System Control victory",
      "flavor": "An impenetrable shield for an irreplaceable world. This is how we claim the stars. —Chief Technician Petrov",
      "art": {
        "style": "Cinematic sci-fi scene like Doug Chiang",
        "description": "A massive energy projection facility with three enormous emitter towers. The generator shows energy visibly coalescing at the tower peaks before expanding outward. The design incorporates cooling systems, power distribution networks, and control facilities. The partial atmospheric shield is visible as a translucent dome extending from the generators into the sky above."
      }
    },
    {
      "id": 20,
      "name": "Terraforming Control Node",
      "type": "structure_planetside",
      "cost": 4,
      "stats": { "defense": 3 },
      "ability": "Modifies planetary environment each turn, providing cumulative bonuses to Terran units",
      "flavor": "We don't just visit worlds—we make them home. —Terraforming Specialist Nguyen",
      "art": {
        "style": "Environmental concept art like Stephan Martiniere",
        "description": "A control center surrounded by visible environmental transformation effects. The structure features monitor arrays showing planetwide data and atmospheric composition readings. The immediate vicinity shows accelerated plant growth and atmospheric processors at work. Energy fields extend from the central spire, visibly altering the surrounding landscape in concentric circles."
      }
    },
    {
      "id": 21,
      "name": "Temporal Distortion Array",
      "type": "structure_orbital",
      "cost": 4,
      "stats": { "defense": 2 },
      "ability": "Can delay opponent actions by spending Energy equal to the action's cost",
      "flavor": "Time is just another battlefield advantage when you know how to manipulate it. —Dr. Ramirez, Temporal Research",
      "art": {
        "style": "Abstract technical art like Peter Elson",
        "description": "A bizarre geometric structure with components that appear to exist in multiple states simultaneously. The array features crystalline elements suspended in electromagnetic fields with energy coursing between nodes. The surrounding space shows visual distortion effects with light bending around the structure. The design deliberately challenges conventional physics with impossible angles and temporal echoes."
      }
    },
    {
      "id": 22,
      "name": "Defense Grid",
      "type": "structure_orbital",
      "cost": 3,
      "stats": { "defense": 2 },
      "ability": "All Terran structures gain +1 Defense",
      "flavor": "A web of protection, each node reinforcing the whole. Together, unbreakable. —Grid Commander Hassan",
      "art": {
        "style": "Hard sci-fi technical illustration like Ron Miller",
        "description": "A network of interconnected orbital platforms generating a protective energy mesh. The grid consists of multiple smaller units working in concert to project energy barriers between them. The design emphasizes efficient energy distribution with power conduits visible between nodes. The protective barrier is shown intercepting incoming projectiles or energy weapons."
      }
    },
    {
      "id": 23,
      "name": "Quantum Observatory",
      "type": "structure_orbital",
      "cost": 3,
      "stats": { "defense": 2, "scan": 2 },
      "ability": "Reveals one card from opponent's hand each turn",
      "flavor": "We see more than stars from up here. We see intentions, possibilities, futures. —Observer First Class Kim",
      "art": {
        "style": "Retro-space age illustration like Chesley Bonestell",
        "description": "An orbital telescope array with multiple detection systems studying spatial anomalies. The observatory features distinctive dish arrays, quantum entanglement detectors, and computing clusters. The structure captures the wonder of cosmic exploration with dramatic positioning near a stellar phenomenon. The design includes human observation decks providing scale to the massive instruments."
      }
    },
    {
      "id": 24,
      "name": "Orbital Factory",
      "type": "structure_orbital",
      "cost": 4,
      "stats": { "defense": 3 },
      "ability": "Produces 2 Energy per turn that must be spent on equipment or upgrades",
      "flavor": "The asteroid belt provides, and we transform raw rock into the tools of civilization. —Factory Director Wei",
      "art": {
        "style": "Industrial sci-fi like John Harris",
        "description": "An automated manufacturing facility processing asteroid materials in orbit. The factory features massive refineries, assembly lines, and material storage areas. Raw resources enter one end while completed components emerge from the other. The design emphasizes industrial processes with conveyor systems, robotic assemblers, and quality control stations visible throughout the structure."
      }
    },
    {
      "id": 25,
      "name": "Quantum Sensor",
      "type": "equipment",
      "cost": 2,
      "ability": "Adds +2 to Scan attempts and allows scanning through interference",
      "equipTarget": "Any ship or structure with Scan capability",
      "flavor": "It doesn't just see through walls—it sees through reality itself. —Tech Specialist Anderson",
      "art": {
        "style": "Technical close-up illustration like Katsuhiro Otomo",
        "description": "A sophisticated scanning device with multiple lenses and quantum field detectors. The device shows internal components through translucent casing with holographic readouts hovering above its surface. The design incorporates both advanced technology and ergonomic considerations for field use. Energy patterns visibly flow through the device's circuitry as it processes data."
      }
    },
    {
      "id": 26,
      "name": "Shield Generator",
      "type": "equipment",
      "cost": 2,
      "ability": "Target gains +2 Defense and can extend shields to one adjacent unit",
      "equipTarget": "Any space station or structure",
      "flavor": "The best offense is not getting hit in the first place. —Engineering Manual, Defensive Systems",
      "art": {
        "style": "Detailed cross-section technical art like Hans Jenssen",
        "description": "A compact energy projection system with visible power core and emitter array. The generator shows both exterior casing and internal components in a technical cutaway view. The device projects a visible energy field that contours to the shape of what it's protecting. Power distribution systems and cooling mechanisms are clearly illustrated in the technical rendering."
      }
    },
    {
      "id": 27,
      "name": "Quantum Warheads",
      "type": "weapon_system",
      "cost": 3,
      "ability": "Equipped ship gains +2 Attack and ignores 1 point of Defense",
      "equipTarget": "Any Capital Ship",
      "flavor": "When conventional weapons fail, we have options that bend the rules of physics. —Weapons Officer Strauss",
      "art": {
        "style": "Military technical illustration like Ian McQue",
        "description": "Advanced weapon systems with reality-warping destructive capabilities. The warheads feature distinctive warning markings and security systems to prevent unauthorized use. The design shows both the delivery mechanism and the exotic materials contained within. The scale of the weapons is emphasized by including human figures for reference near the storage racks."
      }
    },
    {
      "id": 28,
      "name": "Advanced AI Core",
      "type": "upgrade",
      "cost": 3,
      "ability": "Equipped unit or structure can perform one additional action per turn",
      "equipTarget": "Any Terran card",
      "flavor": "It thinks faster than any human, but it still needs us to tell it what to care about. —AI Specialist Kowalski",
      "art": {
        "style": "Cyberpunk digital art like Josan Gonzalez",
        "description": "A neural network processor with holographic interface showing decision trees. The core features cooling systems necessary for quantum computing operations and security protocols. The design shows data visualizations emerging from the processing unit with human operators monitoring its functions. Light patterns suggest sentient activity within the crystalline structure of the processor."
      }
    },
    {
      "id": 29,
      "name": "Orbital Bombardment",
      "type": "event",
      "cost": 3,
      "ability": "Deal 3 damage to target ground unit",
      "effect": "Deal 3 damage to target ground unit",
      "flavor": "Precision from the heavens. The enemy never sees it coming. —Gunnery Chief Barnes",
      "art": {
        "style": "Dramatic action scene like Simon Stålenhag",
        "description": "A devastating energy beam from orbit striking a planetary target with precision. The beam originates from a capital ship partially visible at the top of the frame. The impact creates a shockwave visible from the orbital perspective while remaining precisely targeted. The surrounding environment shows the scale of the attack through atmospheric effects and ground damage patterns."
      }
    },
    {
      "id": 30,
      "name": "Dropship Deployment",
      "type": "event",
      "cost": 0,
      "effect": "Move crew from one ship to reinforce a Surface Unit (+1 to all actions this turn)",
      "flavor": "Reinforcements inbound! Hold the line! —Platoon Commander Jackson",
      "art": {
        "style": "Military action scene like James Gurney",
        "description": "Troops rapidly descending from a dropship under combat conditions. The ship hovers just above ground level with deployment ramps extended and defensive systems active. Soldiers sprint from the ship into defensive positions while under fire from unseen enemies. The scene captures the controlled chaos of battlefield deployment with smoke, atmospheric effects, and urgent movement."
      }
    },
    {
      "id": 31,
      "name": "EMP Pulse",
      "type": "event",
      "cost": 2,
      "effect": "Disable target enemy structure or ship for one turn",
      "flavor": "Their systems go dark, and for one critical moment, we own the battlefield. —Tactical Officer Brennan",
      "art": {
        "style": "Technical effect visualization like Moebius",
        "description": "An expanding electromagnetic wave disabling electronic systems in its path. The pulse originates from a compact device with energy rippling outward in concentric blue rings. Enemy systems visibly short-circuit and power down as the wave passes over them. The illustration uses cross-section elements to show how the pulse affects different technologies."
      }
    },
    {
      "id": 32,
      "name": "Reinforcements",
      "type": "event",
      "cost": 3,
      "effect": "Draw 2 cards and immediately deploy one unit at -1 cost",
      "flavor": "The Consensus never abandons its own. Reinforcements are always coming. —Admiral Kerner",
      "art": {
        "style": "Space opera action scene like Chris Foss",
        "description": "Multiple ships emerging from a gate formation in a dramatic arrival moment. The reinforcement fleet arrives in perfect formation with energy still dissipating from interstellar travel. The design emphasizes the coordinated nature of the Terran military response with ships of various classes arriving simultaneously. The background shows the tactical situation they're arriving to address."
      }
    },
    {
      "id": 33,
      "name": "Final Protocol",
      "type": "event",
      "rarity": "rare",
      "cost": 0,
      "costSpecial": "Sacrifice one structure",
      "effect": "Activate ultimate ability of target structure without meeting normal requirements",
      "flavor": "When all else fails, we have contingencies. Desperate, powerful contingencies. —Emergency Protocol Manual",
      "art": {
        "style": "Dramatic moment like John Harris",
        "description": "A technician activating an emergency system with visible gravity to the moment. The scene shows the final safeguard being removed and the activation sequence initiating. The design emphasizes the significance of the action with warning symbols, multiple confirmation systems, and the determined expression of the operator. Energy begins cascading through previously dormant systems as the protocol activates."
      }
    },
    {
      "id": 34,
      "name": "Emergency Evacuation",
      "type": "event",
      "cost": 1,
      "effect": "Return target surface unit to orbit, preventing its destruction",
      "flavor": "We leave no one behind. That's not a slogan—it's a promise. —Evac Coordinator Mills",
      "art": {
        "style": "Tense action scene like Philippe Druillet",
        "description": "Personnel being rapidly extracted from a deteriorating situation. The evacuation shows transport vessels loading under duress with priority materials and personnel. The scene captures the organized urgency of Terran evacuation protocols amid environmental hazards. The composition directs focus to both the evacuees and the danger they're escaping."
      }
    },
    {
      "id": 35,
      "name": "Orbital Bombardment",
      "type": "event",
      "cost": 3,
      "costAlternate": "0 if played from orbital structure",
      "ability": "Deal 3 damage to target ground unit",
      "effect": "Deal 3 damage to target ground unit",
      "flavor": "Orbital superiority means we choose when and where to apply overwhelming force. —Fleet Coordinator Saito",
      "art": {
        "style": "Epic scale destruction like Karel Thole",
        "description": "Multiple orbital platforms coordinating a wide-area attack on a planetary surface. The bombardment consists of dozens of energy beams converging on a target area from different orbital positions. The attack creates visible atmospheric disturbances as the beams cut through cloud layers. The scale of the operation is emphasized by showing both the orbital platforms and the extensive surface effects."
      }
    },
    {
      "id": 36,
      "name": "Quantum Entanglement",
      "type": "event",
      "cost": 2,
      "effect": "Link two Terran cards, allowing them to share abilities and bonuses",
      "flavor": "Distance becomes meaningless when quantum physics is on your side. —Dr. Hoffmann, Quantum Applications",
      "art": {
        "style": "Abstract scientific visualization like Donato Giancola",
        "description": "Two separate Terran systems becoming synchronized through quantum effects. The entanglement is visualized as energy patterns that mirror each other despite physical separation. The illustration shows both the scientific principle and its tactical application in the field. Subtle color shifts indicate the transfer of properties between the linked systems."
      }
    },
    {
      "id": 37,
      "name": "Sacrifice Play",
      "type": "event",
      "rarity": "rare",
      "cost": 0,
      "costSpecial": "Sacrifice one unit or ship",
      "effect": "Transfer all power and abilities to target structure or unit",
      "flavor": "Sometimes the only way forward is to give everything you have. —Captain Liu's final transmission",
      "art": {
        "style": "Emotional narrative moment like Julie Bell",
        "description": "A Terran officer making a fateful decision to divert all power to a critical system. The composition shows both the officer's resolute expression and the consequences of their decision as systems begin shutting down. The design emphasizes the human element of sacrifice amid advanced technology. Energy visibly transfers from the sacrificed system to the receiving system in a last-ditch effort."
      }
    },
    {
      "id": 38,
      "name": "Scientific Breakthrough",
      "type": "event",
      "cost": 2,
      "effect": "Double Science generation for one turn",
      "flavor": "Eureka! Everything we thought we knew just became obsolete. —Dr. Patel, Theoretical Physics",
      "art": {
        "style": "Inspirational scientific moment like Bob Eggleton",
        "description": "Researchers experiencing a moment of discovery with visible excitement. The laboratory shows holographic data coalescing into a new understanding with researchers pointing at key elements. The design captures the intellectual triumph with appropriate scientific imagery and equipment. The moment of breakthrough is emphasized by lighting that focuses on the central discovery."
      }
    },
    {
      "id": 39,
      "name": "Tactical Maneuvers",
      "type": "event",
      "cost": 1,
      "effect": "Reposition up to 3 Terran units or ships",
      "flavor": "Flexibility is survival. Adapt, reposition, and strike where they least expect. —Tactical Manual, Chapter 3",
      "art": {
        "style": "Strategic visualization like John Schoenherr",
        "description": "A holographic command table showing unit repositioning during an operation. The display shows both friendly and enemy positions with movement paths and tactical options. The design includes command staff analyzing the situation and implementing changes. The visualization uses color coding and symbols consistent with military tactical displays."
      }
    },
    {
      "id": 40,
      "name": "Diplomatic Initiative",
      "type": "event",
      "cost": 2,
      "effect": "Prevent all attacks for one round, draw 1 card",
      "flavor": "Not every problem requires bullets. Sometimes words are the most powerful weapon. —Ambassador Okoro",
      "art": {
        "style": "Formal diplomatic scene like Frank R. Paul",
        "description": "Terran representatives engaging with alien counterparts in a negotiation chamber. The diplomatic meeting takes place in a neutral space with appropriate ceremonial elements from both cultures. The design emphasizes the tension and potential of diplomatic exchange through body language and environmental details. Security personnel remain visible but unobtrusive in the background."
      }
    },
    {
      "id": 41,
      "name": "Quantum Encryption Matrix",
      "type": "artifact",
      "acquisition": "Requires 3 Science points to decrypt",
      "ability": "Once per turn, prevent an opponent's attempt",
      "flavor": "We barely understand it, but we've learned to use it. That's progress. —Dr. Zhang, Artifact Research",
      "art": {
        "style": "Abstract alien technology like Richard M. Powers",
        "description": "An incomprehensible device of clearly non-human origin with impossible geometry. The artifact appears to phase between multiple states with information patterns visible within its structure. The design deliberately defies human engineering principles while suggesting immense computational capability. Researchers visible in the scene provide scale and show attempts to interface with the technology."
      }
    },
    {
      "id": 42,
      "name": "Chronometric Stabilizer",
      "type": "artifact",
      "acquisition": "Found in ancient ruins, requires Science ship scan",
      "ability": "Enhance temporal effects, allowing reroll of one die per turn",
      "flavor": "It predates our civilization by millennia, yet it grants us glimpses of futures yet to come. —Archaeologist Dubois",
      "art": {
        "style": "Ancient-meets-futuristic like Jim Burns",
        "description": "A device that appears simultaneously ancient and beyond current technology. The stabilizer features clockwork-like mechanisms that operate in unusual dimensions with visible temporal effects surrounding it. The design includes both the artifact and the Terran containment systems attempting to harness its capabilities. Temporal distortion is visualized as rippling effects in the local environment."
      }
    },
    {
      "id": 43,
      "name": "Planetary Consciousness Core",
      "type": "artifact",
      "rarity": "rare",
      "acquisition": "Located in neutral territory, requires control of planetary sector",
      "ability": "Special win condition enabler when combined with other technologies",
      "flavor": "It's alive. Not biological, but alive. And it's been waiting for someone to find it. —Dr. Ivanova, First Contact Team",
      "art": {
        "style": "Mind-bending alien artifact like Paul Lehr",
        "description": "A massive crystalline structure buried within planetary crust that pulses with sentient energy. The core features organic-seeming patterns despite its crystalline nature with energy pathways resembling neural networks. The design shows both the artifact and the surrounding excavation revealing its true scale. Human figures near the artifact appear diminished, emphasizing its monumental importance."
      }
    },
    {
      "id": 44,
      "name": "Orbital Dropship",
      "type": "dropship",
      "cost": 2,
      "stats": { "attack": 0, "defense": 2, "speed": 2 },
      "ability": "LAND: Tap and sacrifice to deploy a Marine Squad to the planet surface.",
      "spawns": "Marine Squad",
      "flavor": "Thirty seconds to dirt. Check your gear and say your prayers. —Drop Commander Williams",
      "art": {
        "style": "Military sci-fi like Chris Foss",
        "description": "A heavily armored troop transport designed for orbital insertion. The craft features ablative heat shielding, retro-thrusters, and a reinforced passenger bay. Deployment ramps extend from the underside as the craft descends through atmosphere."
      }
    },
    {
      "id": 45,
      "name": "Orbital Dropship",
      "type": "dropship",
      "cost": 2,
      "stats": { "attack": 0, "defense": 2, "speed": 2 },
      "ability": "LAND: Tap and sacrifice to deploy a Marine Squad to the planet surface.",
      "spawns": "Marine Squad",
      "flavor": "Thirty seconds to dirt. Check your gear and say your prayers. —Drop Commander Williams",
      "art": {
        "style": "Military sci-fi like Chris Foss",
        "description": "A heavily armored troop transport designed for orbital insertion. The craft features ablative heat shielding, retro-thrusters, and a reinforced passenger bay. Deployment ramps extend from the underside as the craft descends through atmosphere."
      }
    },
    {
      "id": 46,
      "name": "Orbital Dropship",
      "type": "dropship",
      "cost": 2,
      "stats": { "attack": 0, "defense": 2, "speed": 2 },
      "ability": "LAND: Tap and sacrifice to deploy a Marine Squad to the planet surface.",
      "spawns": "Marine Squad",
      "flavor": "Thirty seconds to dirt. Check your gear and say your prayers. —Drop Commander Williams",
      "art": {
        "style": "Military sci-fi like Chris Foss",
        "description": "A heavily armored troop transport designed for orbital insertion. The craft features ablative heat shielding, retro-thrusters, and a reinforced passenger bay. Deployment ramps extend from the underside as the craft descends through atmosphere."
      }
    },
    {
      "id": 47,
      "name": "Orbital Dropship",
      "type": "dropship",
      "cost": 2,
      "stats": { "attack": 0, "defense": 2, "speed": 2 },
      "ability": "LAND: Tap and sacrifice to deploy a Marine Squad to the planet surface.",
      "spawns": "Marine Squad",
      "flavor": "Thirty seconds to dirt. Check your gear and say your prayers. —Drop Commander Williams",
      "art": {
        "style": "Military sci-fi like Chris Foss",
        "description": "A heavily armored troop transport designed for orbital insertion. The craft features ablative heat shielding, retro-thrusters, and a reinforced passenger bay. Deployment ramps extend from the underside as the craft descends through atmosphere."
      }
    },
    {
      "id": 48,
      "name": "Orbital Dropship",
      "type": "dropship",
      "cost": 2,
      "stats": { "attack": 0, "defense": 2, "speed": 2 },
      "ability": "LAND: Tap and sacrifice to deploy a Marine Squad to the planet surface.",
      "spawns": "Marine Squad",
      "flavor": "Thirty seconds to dirt. Check your gear and say your prayers. —Drop Commander Williams",
      "art": {
        "style": "Military sci-fi like Chris Foss",
        "description": "A heavily armored troop transport designed for orbital insertion. The craft features ablative heat shielding, retro-thrusters, and a reinforced passenger bay. Deployment ramps extend from the underside as the craft descends through atmosphere."
      }
    },
    {
      "id": 49,
      "name": "Survey Team Beta",
      "type": "surface_unit",
      "cost": 2,
      "stats": { "attack": 1, "defense": 1, "scan": 2 },
      "ability": "Can locate hidden resources and artifacts. Grants +1 Research when surveying.",
      "flavor": "The universe is vast, but we'll map every corner of it. —Survey Lead Thompson",
      "art": {
        "style": "Painted illustration like Frank Frazetta",
        "description": "A second survey team examining crystalline formations on an alien landscape. Their equipment includes advanced ground-penetrating sensors and holographic mapping devices."
      }
    },
    {
      "id": 50,
      "name": "Survey Team Gamma",
      "type": "surface_unit",
      "cost": 2,
      "stats": { "attack": 1, "defense": 1, "scan": 2 },
      "ability": "Can locate hidden resources and artifacts. Grants +1 Research when surveying.",
      "flavor": "These ruins hold secrets worth dying for. Good thing we're not planning to die. —Team Leader Foster",
      "art": {
        "style": "Painted illustration like Frank Frazetta",
        "description": "An elite survey team investigating ancient ruins. They carry specialized equipment for artifact recovery and analysis."
      }
    },
    {
      "id": 51,
      "name": "Survey Team Delta",
      "type": "surface_unit",
      "cost": 2,
      "stats": { "attack": 1, "defense": 2, "scan": 2 },
      "ability": "Can locate hidden resources and artifacts. Grants +1 Research when surveying. Enhanced defensive capabilities.",
      "flavor": "Hostile environment? We're Survey Team Delta. Hostile is our specialty. —Field Commander Reeves",
      "art": {
        "style": "Painted illustration like Frank Frazetta",
        "description": "A heavily-equipped survey team with additional defensive gear. They specialize in surveying hostile territories."
      }
    }
  ]
}
